Until now we have done many things with pandas like 

1. Reading a CSV file 
2. Analysing columns 
3. Getting Statistics of Data
4. Subsetting dataframe rows 
5. Subsetting columns. 
6. Making plots 
7. Finding missing values and filling those values. 

Now one part is remaining and that is of modifying the dataframes, 
either by 
1. One value in dataframe
2. Adding a new column
3. Modifying an existing column. 
4. Modifying all dataframe. 

So today we will go through that.

## Identifying and Modifying 1 value in dataframe.

First we need to identify a single value in dataframe. 

We know we can use `.loc` and `.iloc` to select values in a dataframe.

In [1]:
import pandas as pd 

data = pd.read_csv('datasets/titanic_train.csv')

data.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

Suppose in the first row we have missing value in **Cabin** column and by some luck, we know the original value. 

Suppose that value is B24. So need to replace the missing value to `B24`. 

First let's try to identify the place or try to extract that value. If we can extract it we can replace it also.

In [2]:
data.iloc[0,'Cabin']

ValueError: Location based indexing can only have [integer, integer slice (START point is INCLUDED, END point is EXCLUDED), listlike of integers, boolean array] types

We know it's the second last column

In [3]:
data.iloc[0,-2]

nan

Now we can set the value using the above syntax as

In [4]:
data.iloc[0,-2] = 'B24'

In [5]:
data.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,B24,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

We can use `loc` also when we don't know the number. 

This will be useful when we have to use some condition to replace values. 

Let's now replace the 3rd row value

In [7]:
data.loc[2,'Cabin']

nan

In [8]:
data.loc[2,'Cabin'] = 'C38'

In [9]:
data.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,B24,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,C38,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

We have seen that we can extract individual values and replace them also using loc and iloc. 

We can replace multiple values using them also . 

Let's replace all the missing values in Cabin column to "N/A"

In [10]:
data.loc[data.Cabin.isna(),'Cabin']

4      NaN
5      NaN
7      NaN
8      NaN
9      NaN
12     NaN
13     NaN
14     NaN
15     NaN
16     NaN
17     NaN
18     NaN
19     NaN
20     NaN
22     NaN
24     NaN
25     NaN
26     NaN
28     NaN
29     NaN
30     NaN
32     NaN
33     NaN
34     NaN
35     NaN
36     NaN
37     NaN
38     NaN
39     NaN
40     NaN
      ...
852    NaN
854    NaN
855    NaN
856    NaN
858    NaN
859    NaN
860    NaN
861    NaN
863    NaN
864    NaN
865    NaN
866    NaN
868    NaN
869    NaN
870    NaN
873    NaN
874    NaN
875    NaN
876    NaN
877    NaN
878    NaN
880    NaN
881    NaN
882    NaN
883    NaN
884    NaN
885    NaN
886    NaN
888    NaN
890    NaN
Name: Cabin, Length: 685, dtype: object

In [11]:
data.loc[data.Cabin.isna(),'Cabin'] = "N/A"

In [13]:
data.Cabin.isna().sum()

0

We learned a simple trick last time to fill missing values. 

```
data.fillna("N/A")
```

### Adding a New Column 

Adding a new column is very easy in pandas. The syntax is simple 

```
data['NewColName'] = NewColValues 
```

Suppose we want to add a new column Year to our dataset.

In [14]:
data['Year'] = 1914  # because it happened in 1914

In [15]:
data.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Year
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,B24,S,1914
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,1914
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,C38,S,1914
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S,1914
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,N/A,S,1914

Here we see broadcasting happening which we learned in numpy. 

If there is single value, then it's broadcasted to all rows. 

We can pass a list also.

In [16]:
year = [1912,1913,1914]

data['Year'] = year

ValueError: Length of values does not match length of index

The error is because the list should be of same length as the number of rows. So we need to add that many elements.

In [17]:
year

[1912, 1913, 1914]

In [18]:
year*2

[1912, 1913, 1914, 1912, 1913, 1914]

In [19]:
891/3

297.0

In [20]:
data['Year'] = year*297

In [21]:
data.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Year
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,B24,S,1912
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,1913
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,C38,S,1914
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S,1912
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,N/A,S,1913

Removing a column is simple we have seen 

use `del`

```
del data['Year']
```

In [22]:
del data['Year']

In [23]:
data.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,B24,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,C38,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,N/A,S

### Modifying an existing column 

Suppose your column has some value, which you want to edit. 

Here we have Fare. Suppose we want to make the fare as integer.

#### Changing the datatype 

We can change the datatype of a column using `.astype()` function

In [25]:
data['Fare'] = data['Fare'].astype(int)

data['Fare'].head()

0     7
1    71
2     7
3    53
4     8
Name: Fare, dtype: int64

Converting fare to string

In [26]:
data['Fare'] = data['Fare'].astype(str)

data['Fare'].head()

0     7
1    71
2     7
3    53
4     8
Name: Fare, dtype: object

In [27]:
data['Fare'] = data['Fare'].astype(float)

data['Fare'].head()

0     7.0
1    71.0
2     7.0
3    53.0
4     8.0
Name: Fare, dtype: float64

We have lost precision here.

### Modifying a the values of column to another value. 

Suppose we want the male / female to Title case that is 

Male / Female

In [28]:
data.Sex

0        male
1      female
2      female
3      female
4        male
5        male
6        male
7        male
8      female
9      female
10     female
11     female
12       male
13       male
14     female
15     female
16       male
17       male
18     female
19     female
20       male
21       male
22     female
23       male
24     female
25     female
26       male
27       male
28     female
29       male
        ...
861      male
862    female
863    female
864      male
865    female
866    female
867      male
868      male
869      male
870      male
871    female
872      male
873      male
874    female
875    female
876      male
877      male
878      male
879    female
880    female
881      male
882    female
883      male
884      male
885    female
886      male
887    female
888    female
889      male
890      male
Name: Sex, Length: 891, dtype: object

There is an `.str` attribute of each string column which gives us the string value method and we can apply any string function to it.

In [31]:
data.Sex.str

In [32]:
data.Sex.str.title()

0        Male
1      Female
2      Female
3      Female
4        Male
5        Male
6        Male
7        Male
8      Female
9      Female
10     Female
11     Female
12       Male
13       Male
14     Female
15     Female
16       Male
17       Male
18     Female
19     Female
20       Male
21       Male
22     Female
23       Male
24     Female
25     Female
26       Male
27       Male
28     Female
29       Male
        ...
861      Male
862    Female
863    Female
864      Male
865    Female
866    Female
867      Male
868      Male
869      Male
870      Male
871    Female
872      Male
873      Male
874    Female
875    Female
876      Male
877      Male
878      Male
879    Female
880    Female
881      Male
882    Female
883      Male
884      Male
885    Female
886      Male
887    Female
888    Female
889      Male
890      Male
Name: Sex, Length: 891, dtype: object

Now it's a simple matter of setting the existing column to this value.

In [33]:
data.Sex = data.Sex.str.title()
data.Sex.head()

0      Male
1    Female
2    Female
3    Female
4      Male
Name: Sex, dtype: object

Keep in mind that these functions can only be applied on string. 

The list of functions can be see in [documentation](https://www.w3schools.com/python/python_ref_string.asp)

This `.str` gives us a vectorized operation. So doing things are fast. 

Suppose you want to replace all the commas in a column with ;

In [35]:
data.Name.head()

0                              Braund, Mr. Owen Harris
1    Cumings, Mrs. John Bradley (Florence Briggs Th...
2                               Heikkinen, Miss. Laina
3         Futrelle, Mrs. Jacques Heath (Lily May Peel)
4                             Allen, Mr. William Henry
Name: Name, dtype: object

In [36]:
data.Name.str.replace(',',';').head()

0                              Braund; Mr. Owen Harris
1    Cumings; Mrs. John Bradley (Florence Briggs Th...
2                               Heikkinen; Miss. Laina
3         Futrelle; Mrs. Jacques Heath (Lily May Peel)
4                             Allen; Mr. William Henry
Name: Name, dtype: object

### Modifying columns which are not strings. 

Ok so this is one of the things, which we use a lot. 

Let's imagine the use cases

1. There is some column which has values, you want to create a new column based on those values. e.g. the age column. You are fan of movies and from Titanic you see that women and children are saved in the movies. So you want to see does it really happen? What you do? YOu only have age and gender column. You want to take the age column and  create a new column which has values, child, teen and adult.  

2. There is some column where you want to divide the people based on fare. If some fare is greater than some threshold, keep the word threshold in your mind. Suppose if fare is more than 15$ then the person is middle class, greater > 50 , rich and less than 15, lower class. 

3. You have fare in $ or pounds, but you are indian, you want to convert it to rupees. We understand 1,00,000 not 0.1 million. So you want to convert the column. 

All these cases can be handled with a simple trick. 

Create a function which takes a column as input and checks value in each row. Then based on that value, it returns a new value. That new value will be assigned to a new column for that row vale. 

I think that's a lot of talking. Let's do this.

In [37]:
def isChildTeenOrAdult(age):
    if age < 12:
        return 'child'
    elif age < 17 : 
        return 'teen'
    else :
        return 'adult'
    
# we have our classifier function which classifies person based on age.

In [38]:
data.Age.apply(isChildTeenOrAdult)

0      adult
1      adult
2      adult
3      adult
4      adult
5      adult
6      adult
7      child
8      adult
9       teen
10     child
11     adult
12     adult
13     adult
14      teen
15     adult
16     child
17     adult
18     adult
19     adult
20     adult
21     adult
22      teen
23     adult
24     child
25     adult
26     adult
27     adult
28     adult
29     adult
       ...
861    adult
862    adult
863    adult
864    adult
865    adult
866    adult
867    adult
868    adult
869    child
870    adult
871    adult
872    adult
873    adult
874    adult
875     teen
876    adult
877    adult
878    adult
879    adult
880    adult
881    adult
882    adult
883    adult
884    adult
885    adult
886    adult
887    adult
888    adult
889    adult
890    adult
Name: Age, Length: 891, dtype: object

Apply is the magic function. With it you can apply any custom function to a column and get a value

In [39]:
data['isChild'] = data.Age.apply(isChildTeenOrAdult)

In [40]:
data.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,isChild
0,1,0,3,"Braund, Mr. Owen Harris",Male,22.0,1,0,A/5 21171,7.0,B24,S,adult
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",Female,38.0,1,0,PC 17599,71.0,C85,C,adult
2,3,1,3,"Heikkinen, Miss. Laina",Female,26.0,0,0,STON/O2. 3101282,7.0,C38,S,adult
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",Female,35.0,1,0,113803,53.0,C123,S,adult
4,5,0,3,"Allen, Mr. William Henry",Male,35.0,0,0,373450,8.0,N/A,S,adult

Now you can use any custom logic